#+title: Go Notes
<2022-05-01 Sun>
** Build                                                           :noexport:
#+begin_src sh :results raw
#!/bin/sh

# Exit on command failure
set -e

rm -Rf ~/tmp/hello-go

../scripts/tangle.sh go.org

cd ~/tmp/hello-go

go mod init sr.ht/~thales17/dotfiles/notes/go/hello-go

go run .
#+end_src

#+RESULTS:
Hello, Go!

*** Build                                                          :noexport:
- Ensure the latest Go 1.8 software is installed, current that is =go1.18rc1=, =go install golang.org/dl/go1.18rc1@latest=
#+begin_src sh :results raw
#!/bin/sh

# Exit on command failure
set -e

rm -Rf ~/tmp/go-generics-simple

../scripts/tangle.sh go.org

cd ~/tmp/go-generics-simple

go1.18rc1 mod init sr.ht/~thales17/dotfiles/notes/go/go-generics-simple

go1.18rc1 run .
#+end_src

#+RESULTS:
Non-Generic Sums: 46 and 62.97
Generic Sums: 46 and 62.97
Generic Sums with Constraint: 46 and 62.97
